Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In most cases, Flink can automatically infer types and generate the correct TypeInfor mation.
zh_cn: 大多数情况下，Flink可以自动推断类型并生成正确的TypeInformation。

source: In most real-world applications, the expectation is that events should not get lost.
zh_cn: 对大多数现实应用而言，用户期望是不丢事件，

source: In most real-world applications, the minimum requirement is that events do not get lost.
zh_cn: 对大多数现实应用而言，最低要求是不丢失事件，

source: In order for this to work, the POJO class and its fields need to be annotated with Cassandra annotations and provide setters and getters for all fields as shown in Example 8-9.
zh_cn: 为了让映射器能正常工作，我们需要像示例8-9那样，为POJO类和它的字段添加Cassandra注解，并针对所有字段提供setter和getter方法。

source: In order to achieve deterministic transformations on ConnectedStreams, connect() can be combined with keyBy() or broadcast().
zh_cn: 为了在ConnectedStreams上实现确定性的转换，connect()可以与keyBy()和broadcast()结合使用。

source: In order to achieve end-to-end exactly-once seman‐ tics, an application requires either idempotent or transactional sink connectors.
zh_cn: 为了实现端到端的精确一次语义，应用的连接器需要是幂等性的或支持事务。

source: In order to be able to delete the currently registered timer, its
zh_cn: 为了删除当前已经注册的计时器，

source: In order to build Flink for a specific Hadoop version, you need Flink’s source code, which can be obtained by downloading the source distribution from the website or cloning a stable release branch from the project’s Git repository, a Java JDK of at least version 8, and Apache Maven 3.2.
zh_cn: 为了针对特定Hadoop版本构建Flink，你需要Flink源代码（可以从官网下载源代码发布版或从项目Git仓库中克隆一个稳定版本分支），Java JDK（8以上版本）以及Apache Maven 3.2。

source: In order to clean up all state when a window is deleted, the clear() method of
zh_cn: 为了在删除窗口时彻底清理状态，

source: In order to do this efficiently, Flink requires detailed knowledge of the types of data the application processes.
zh_cn: 为了提高上述过程的效率，Flink需要详细了解应用处理的数据类型。

source: In order to ease the implementation of transactional sinks, Flink’s DataStream API provides two templates that can be extended to implement custom sink operators.
zh_cn: 为了简化事务性数据汇的实现，Flink DataStream API提供了两个模板，可供其他类继承以实现自定义数据汇算子。

source: In order to enable Flink’s HA mode, you need to adjust Flink’s configuration and pro‐ vide information such as the hostnames of the ZooKeeper quorum nodes, a path to a persistent storage, and a cluster ID for Flink.
zh_cn: 为了启用Flink HA模式，你需要调整Flink的配置并提供一些信息。例如：ZooKeeper Quorum节点的主机名，持久化存储路径以及Flink集群ID。

source: In order to enable a smooth pipelined data exchange, a TaskManager must be able to provide enough buf‐ fers to serve all outgoing and incoming connections concurrently.
zh_cn: 为了使流水线式的数据交换平滑进行，TaskManager必须提供足够多的缓冲区来同时服务全部进出连接。

source: In order to enable a smooth pipe‐ lined data exchange, a TaskManager must be able to provide enough buffers to serve all outgoing and incoming connections concurrently.
zh_cn: 为了使流水线式的数据交换平滑进行，TaskManager必须提供足够多的缓冲区来同时服务所有进出连接。

source: In order to enable the queryable state service in a Flink setup—to start client proxy and server threads within the TaskManagers—you need to add the flink-queryable- state-runtime JAR file to the classpath of the TaskManager process.
zh_cn: 为了在Flink设置中启用可查询式状态服务（即在TaskManager中启动客户端代理和服务器线程），你需要将flink-queryable-state-runtime JAR文件放到TaskManager进程的Classpath中。

source: In order to ensure at-least-once result correctness, you need to have a mechanism to replay events, either from the source or from some buffer.
zh_cn: 为了确保至少一次结果的正确，需要一些机制从源头或缓冲中重放事件。

source: In order to ensure at-least-once result correctness, you need to have a way to replay events—either from the source or from some buffer.
zh_cn: 为了确保至少一次结果语义的正确性，需要想办法从源头或缓冲区中重放事件。

source: In order to evaluate such operations effi‐ ciently on unbounded streams, you need to limit the amount of data these operations maintain.
zh_cn: 为了在无限数据流上高效地执行这些操作，必须限制操作所维持的数据量。

source: In order to evaluate such operations efficiently on unbounded streams, you need to limit the amount of data these operations maintain.
zh_cn: 为了在无限数据流上高效地执行这些操作，必须对操作所维持的数据量加以限制。

source: In order to execute a Flink application, all classes in the application’s JAR file must be loaded by a classloader.
zh_cn: 为了执行Flink应用，所有应用JAR包中的类都需要由一个类加载器进行加载。

source: In order to execute a dataflow program, its logical graph is converted into a physical dataflow graph, which includes details about how the computation is going to be executed.
zh_cn: 为了执行dataflow程序，需要将逻辑图转化为物理dataflow图，它们包含了计算执行的细节。

source: In order to execute a dataflow program, its logical graph is converted into a physical dataflow graph, which specifies in detail how the program is executed.
zh_cn: 为了执行Dataflow程序，需要将逻辑图转化为物理Dataflow图，后者指定了程序的执行细节。

source: In order to extract event-time timestamps and generate watermarks, you can provide an AssignerWithPeriodicWatermark or an AssignerWithPunctuatedWatermark to a Kafka consumer by calling a FlinkKafkaConsumer.assignTimestampsAndWater mark().3 An assigner is applied to each partition to leverage the per partition order‐ ing guarantees, and the source instance merges the partition watermarks according to
zh_cn: 为了提取事件时间的时间戳并生成水位线，你可以通过调用FlinkKafkaConsumer.assignTimestampsAndWatermark()方法向Kafka消费者提供一个AssignerWithPeriodicWatermark或AssignerWithPunctuatedWatermark对象。3 为了利用Kafka分区内部保序特性，分配器会作用在每个分区上，随后数据源实例会根据水位线传播协议（参照"水位线穿过和事件时间"一节）对各分区的水位线进行合并。

source: In order to gen‐ erate satisfying watermarks you need to reason about the smallest timestamp of a record that is included in a split later processed by the task.
zh_cn: 为了生成满足需求的水位线，你需要根据稍后由任务处理的输入划分中的记录，推断最小时间戳。

source: In order to grasp the problem of modifying the data type of a state, we have to under‐ stand how state data is represented within a savepoint.
zh_cn: 为了弄清状态数据类型的修改问题，我们需要理解状态数据在保存点中的表示形式。

source: In order to increase or decrease the parallelism of a function with operator state, the operator state needs to be redistributed to a larger or smaller number of task instances.
zh_cn: 为了达到该目的，Flink需要将算子状态重新分配到更多或更少的任务实例上。

source: In order to keep the data of the data warehouse up-to-date, ETL processes need to run periodically.
zh_cn: 同时为了保证数据仓库中数据的实效，ETL流程需要定期重复执行。

source: In order to make Flink’s runtime aware of the state of an operator, the operator needs to register its state.
zh_cn: 为了让Flink的运行层知道算子有哪些状态，算子需要自己对其进行注册。

source: In order to perform a graceful shutdown, the run() method, which runs in a separate thread, should terminate as soon as the cancel() method is called.
zh_cn: 为了关闭过程可以顺利完成，运行在单独线程内的run()方法需要在cancel()方法调用后立即终止。

source: In order to populate a data ware‐ house, the data managed by the transactional database systems needs to be copied to it.
zh_cn: 为了填充它，需要将事务型数据库系统中的数据拷贝过去，

source: In order to populate a data warehouse, the data managed by the transac‐ tional database systems needs to be copied to it.
zh_cn: 为了填充数据仓库，需要将事务型数据库系统中的数据拷贝过去，

source: In order to prevent increasing resource consumption of an application over time, it is important that the size of the operator state be controlled.
zh_cn: 为了防止应用资源逐渐耗尽，关键要控制算子状态大小。

source: In order to prevent temporal inconsistencies during recovery and provide exactly- once output guarantees for applications with nondeterministic application logic, Flink’s Cassandra connector can be configured to leverage a WAL.
zh_cn: 为了避免在恢复期间出现短暂的不一致现象，并为逻辑不确定的应用提供精确一次的输出保障，Flink的Cassandra连接器可以通过配置启用WAL。

source: In order to provide a concise window operator
zh_cn: 为了使窗口算子的API保持简洁，

source: In order to provide exactly-once state consistency for an application,1 each source connector of the application needs to be able to set its read positions to a previously checkpointed position.
zh_cn: 为了在应用中实现精确一次的状态一致性保障，1 应用的每个数据源连接器都需要支持将读取位置设为过去某个检查点中的值。

source: In order to provide fault tolerance for an application, the JobManager initiates checkpoints at regular intervals.
zh_cn: 为了支持应用容错，JobManager会以固定间隔创建检查点。

source: In order to recover from a master pod failure, you need to configure a highly available setup.
zh_cn: 为了从主进程Pod的故障中恢复，需要进行一些高可用设置。

source: In order to recover from master failures, a highly available setup needs to be configured as described in a later section.
zh_cn: 为了在主进程发生故障时可以恢复，我们需要对它进行高可用性配置，有关内容会在下节讨论。

source: In order to remove the savepoint we triggered before, call the command:
zh_cn: 为了删除之前生成的保存点，我们可以使用以下命令：

source: In order to retrieve one or more JobManager metrics, add the get query parameter with all the requested metrics to the request:
zh_cn: 为了得到一个或多个JobManager指标，可以将它们以get查询参数的方式加入到请求中：

source: In order to run Flink on Windows, you can use a provided bat script or you can use the regular bash scripts on the Windows Subsystem for Linux (WSL) or Cygwin.
zh_cn: 为了在Windows上运行Flink，你可以使用项目提供的bat脚本，或者基于WSL或Cygwin运行常规的bash脚本。

source: In order to run the example, you have to start the streaming application with the queryable state first.
zh_cn: 为了运行这个示例，你需要先将配置了可查询式状态的应用启动起来。

source: In order to satisfy the requirements for task chaining, two or more operators must be configured with the same parallelism and be connected by local forward channels.
zh_cn: 为了满足任务链接的条件，多个算子必须有相同的并发度且通过本地转发通道连接。

source: In order to satisfy the requirements for task chaining, two or more operators must be configured with the same parallelism and connected by local forward channels.
zh_cn: 任务链接的前提条件是，多个算子必须有相同的并行度且通过本地转发通道连接。

source: In order to scale writing to and reading from a topic, it can be split into partitions that are dis‐ tributed across a cluster.
zh_cn: 为了实现主题读写的伸缩性，Kafka允许将主题拆分为多个分布在集群之上的分区。

source: In order to set up a standalone Flink cluster, download a binary distribution from the Apache Flink website and extract the tar archive with the command:
zh_cn: 为了搭建一个Flink独立集群，你可以从Apache Flink的官网下载它的二进制发行版，然后利用以下命令对tar文件进行解压：

source: In order to start a distributed Flink cluster that runs on multiple machines, you need to adjust the default configuration and complete a few more steps.
zh_cn: 为了在多台机器上搭建Flink集群，你需要调整一下默认的配置并完成一些额外步骤。

source: In order to successfully run applications on a Flink cluster that is deployed on Minikube, you need to run the following command
zh_cn: 为了在基于Minukube的Flink集群上运行应用，你需要在部署Flink前执行以下命令：

source: In order to take a savepoint before canceling a running application add the -s flag to the cancel command:
zh_cn: 如果要在取消当前运行的应用之前生成一个保存点，请在cancel命令后面加上-s参数：

source: In order to take advantage of AsyncFunction, the external system should provide a client that supports asynchronous calls, which is the case for many systems.
zh_cn: 为了充分利用AsyncFunction，外部系统最好能够提供一个支持异步调用的客户端，很多现有系统都可以做到这点。

source: In order to use a provided connector in your application, you need to add its depend‐ ency to the build file of your project.
zh_cn: 为了在应用中使用这些连接器，你需要把相应的依赖添加到项目的构建文件中。

source: In order to use processing time, replace TimeCharacteristic.EventTime with
zh_cn: 如果需要使用处理时间，请将TimeCharacteristic.EventTime替换为TimeCharacteristic.ProcessingTime。

source: In other words, events can be simply dropped and nothing is done to ensure result correctness.
zh_cn: 换句话说，事件可以随意丢弃，没有任何机制来保证结果的正确性。

source: In other words, events can be simply dropped and there is no mechanism to ensure result correctness.
zh_cn: 换句话说，事件可以随意丢弃，没有任何机制来保证结果的正确性。

source: In our discussion about event-time windows so far, we have overlooked one very important aspect: how do we decide when to trigger an event-time window?
zh_cn: 在到目前为止有关事件时间窗口的讨论中，我们一直忽略了一个非常重要的方面：如何决定触发事件时间窗口的时间？

source: In our example, the result is a DataStream[SensorReading] record.
zh_cn: 在所给示例中，输出结果是DataStream[SensorReading]中的记录。

source: In our example, we define the AverageSensorReadings object and include most of the application logic inside main().
zh_cn: 在示例中，我们定义了AverageSensorReadings对象，并将大部分应用逻辑都放到了main()方法里。

source: In our example, we first apply a map() transformation that converts the temperature of each sensor reading to Celsius.
zh_cn: 在示例中，我们首先利用map()转换将每个传感器读取的温度都转换为摄氏度。

source: In our example, we retrieve the execution environment by calling the static getExecutionEnvironment() method.
zh_cn: 在示例中，我们通过调用静态的getExecutionEnvironment()方法来获取执行环境。

source: In our example, we use:
zh_cn: 在示例中，我们通过：

source: In parallel windows, each partition applies the window policies independently of other partitions.
zh_cn: 并行窗口中，每个数据分区都会都会各自应用独立于其他分区的窗口策略。

source: In parallel windows, each partition applies the win‐ dow policies independently of other partitions.
zh_cn: 并行窗口中，每个数据分区所应用的窗口策略都相互独立。

source: In particular the following features let it stand out:
zh_cn: 尤其是以下功能使其在同类系统中脱颖而出。

source: In particular, the following features make Flink stand out:
zh_cn: 尤其是以下功能使其在同类系统中脱颖而出：

source: In particular, we explain Flink’s distributed architecture, show how Flink handles time and state in streaming applications, and discuss its fault tolerance mechanisms.
zh_cn: 我们将重点解释Flink的分布式架构，展示它如何在流式应用中处理时间和状态并讨论它的容错机制。

source: In particular, we explain Flink’s distributed architecture, show how it handles time and state in streaming applications, and discuss its fault- tolerance mechanisms.
zh_cn: 我们会重点解释Flink的分布式架构，展示它如何在流式应用中处理时间和状态，并讨论它的容错机制。

source: In practice though you might want to partition a stream into multiple logical streams and define parallel windows.
zh_cn: 但在实际应用中，你可能会想将数据流划分为多条逻辑流并定义一些并行窗口（parallel window）。

source: In practice, you need to make an educated guess and use heuristics to generate watermarks in your applica‐ tions.
zh_cn: 在实践中，你需要一些有依据的猜测并使用启发式方法为应用生成水位线。

source: In principle, save‐ points are created using the same algorithm as checkpoints and hence are basically checkpoints with some additional metadata.
zh_cn: 原则上，保存点的生成算法和检查点完全一样，因此可以把保存点看做包含一些额外元数据的检查点。

source: In principle, state can be stored and accessed in many different places including pro‐ gram variables, local files, or embedded or external databases.
zh_cn: 原则上，可以在很多不同的位置存储并访问状态，例如：应用程序变量、本地文件、嵌入式或外部数据库。

source: In principle, you only need to adjust the YAML files that describe your deployments to use an image that contains the job code and configure it to automatically start the job when the container is started.
zh_cn: 原则上，你只需要调整YAML文件把Deployment设置为使用包含作业代码的镜像，并将它配置为在容器启动时自动启动作业即可。

source: In row encoding mode, every record is individually encoded
zh_cn: 在行编码模式下，每条记录都会被单独编码并添加到分块文件里。

source: In some situations, a pending file is never committed.
zh_cn: 在一些情况下，处于等待阶段的文件可能永远都无法提交。

source: In streaming systems you usually want to ensure that your system can handle the maximum expected rate of events.
zh_cn: 在流处理系统中，你通常希望系统有能力应对以最大期望速率到来的事件。

source: In such a case, a function with keyed state would accumulate state for more and more
zh_cn: 此时，具有键值分区状态的函数就会积累越来越多的键值。

source: In such a case, a job is executed repeatedly over batches of incoming events.
zh_cn: 在以往的场景中，作业会在批量传入的事件上重复执行。

source: In such a situation, an application would end up in an infinite recovery cycle consuming lots of resources without a chance of ever get‐ ting back into regular processing.
zh_cn: 在该情况下，应用将陷入无休止的恢复周期，虽然消耗大量资源但无法恢复常规处理。

source: In such applications, we would like to group together events that origin from the same period of user activity or session.
zh_cn: 在该应用中我们要把事件按照用户的同一活动或会话来源进行分组。

source: In such applications, we would like to group together events that originate from the same period of user activity or session.
zh_cn: 在该应用中我们要把事件按照用户的同一活动或会话来源进行分组。

source: In such cases, you need to generate a TypeInformation for a specific data type.
zh_cn: 这些情况下，你就需要为特定数据类型生成TypeInformation。

source: In that case, it is recom‐ mended to not use timers excessively, to avoid long checkpointing times.
zh_cn: 在这种情况下，建议不要使用太多计时器，以避免检查点生成时间过久。

source: In the DataStream API this is done by providing a ProcessWindowFunction as a sec‐ ond parameter to the reduce() or aggregate() methods as shown in the following code:
zh_cn: 在DataStream API中，实现上述过程的途径是将ProcessWindowFunction作为reduce()或aggregate()方法的第二个参数，如以下代码所示：

source: In the DataStream API, the execution environment of an
zh_cn: DataStream API的执行环境由StreamExecutionEnvironment来表示。

source: In the Data‐ Stream API, you can use the time characteristic to tell Flink how to define time when you are creating windows.
zh_cn: 在DataStream API中，你可以使用时间特性告知Flink在创建窗口时如何定义时间。

source: In the Java DataStream API, you can also use the returns() method to explicitly specify the return type of an operator when defining the dataflow as shown in the fol‐
zh_cn: 你还可以像下面这样，在定义Dataflow时使用Java DataStream API中的returns()方法来显式指定某算子的返回类型：

source: In the Scala API, Flink uses Scala compiler macros that generate TypeInformation objects for all data types at compile time.
zh_cn: 在Scala API中，Flink利用Scala编译器的宏功能在编译时为所有数据类型生成TypeInformation对象。

source: In the beginning of this chapter, you saw how you can model streaming programs as dataflow graphs.
zh_cn: 在本章开头，你学到了如何将流处理程序建模成Dataflow图。

source: In the case of a failure, a sink task needs to reset its current in-progress file to its writ‐ ing offset at the last successful checkpoint.
zh_cn: 在发生故障的情况下，数据汇任务需要将它当前正在写入文件的写入偏移重置到上一次成功的检查点。

source: In the case of a mobile game, consequences can be as bad as Alice and her team getting disappointed and never playing again.
zh_cn: 在这个手游例子中，后果可能非常糟糕，以至于爱丽丝和她团队的其他玩家失望透顶，再也不想碰这个游戏。

source: In the case of a recovery cycle, this may take some time.
zh_cn: 若恰好赶上恢复周期，等待时间可能会比较久。

source: In the case of a recovery or when starting from a savepoint, an application will start reading from the offsets stored in the check‐ point or savepoint.
zh_cn: 在进行故障恢复或从保存点开始启动的情况下，应用将从存储在检查点或保存点中的偏移开始读取。

source: In the case of downscaling, the surplus tasks are simply canceled since state is already replicated and will not be lost.
zh_cn: 在缩容的情况下，由于状态经过复制不会丢失，我们可以简单地停掉多出的任务。

source: In the coffee shop example, you will probably see this happening right after lunch.
zh_cn: 在咖啡店的例子中，你很有可能在午餐后见到这种情况：

source: In the context of Flink’s Kafka sink, this is important because transactions that time out—due to long recovery cycles, for example—lead to data loss.
zh_cn: 该配置属性对Flink的Kafka数据汇而言非常重要，因为事务超时（例如由于长时间的故障恢复周期而引起）会导致数据丢失。

source: In the context of an event- time window operator, an event is late if it arrives at the operator and the window assigner maps it to a window that has already been computed because the operator’s watermark passed the end timestamp of the window.
zh_cn: 在事件时间窗口算子的环境下，如果事件到达算子时窗口分配器为其分配的窗口已经因为算子水位线超过了它的结束时间而计算完毕，那么该事件就被认为是迟到的。

source: In the context of stream processing, one disadvantage of buffering is that it adds latency because records are collected in a buffer instead of being immediately shipped.
zh_cn: 在流处理环境下，缓冲的一个明显缺点是会增加延迟，因为记录首先要收集到缓冲区中而不会立即发送。

source: In the example above, MyAssigner can either be of type AssignerWithPeriodicWater marks or AssignerWithPunctuatedWatermarks.
zh_cn: 在上面的例子中，MyAssigner既可以是AssignerWithPeriodicWatermarks，也可以是AssignerWithPunctuatedWatermarks。

source: In the example below, the stream is keyed by language and the result is a continuously updated list of words per language:
zh_cn: 在下面的示例中，数据流会以语言字段（译者注：第一个字段）为键值进行分区，最终结果是针对每种语言产生一个不断更新的单词列表：

source: In the following example, the source operator will be executed with the default parallel‐ ism of the environment, the map transformation has double as many tasks as the source, and the sink operation will always be executed by two parallel tasks:
zh_cn: 下面的示例中，数据源算子会以环境默认并行度执行，map转换的任务数是数据源的两倍，数据汇操作固定以两个并行任务执行：

source: In the following example, we implement a FilterFunction that filters for strings that contain the word "flink":
zh_cn: 下面的例子中，我们实现了一个FilterFunction，用来过滤出所有包含"flink"一词的字符串。

source: In the following section, we discuss the connectors for Apache Kafka, file-based sour‐ ces and sinks, and Apache Cassandra.
zh_cn: 下一节，我们将讨论针对以下系统的连接器：Apache Kafka、文件系统以及Apache Cassandra。

source: In the following sections, we briefly discuss credit-based flow control and task chain‐ ing.
zh_cn: 在接下来的几节，我们简要讨论一下基于信任度的流量控制以及任务链接（task chaining）。

source: In the following sections, we discuss the lifecycle of windows and introduce the inter‐ faces to define custom window assigners, triggers, and evictors.
zh_cn: 下面几节我们将讨论窗口的生命周期并介绍用于自定义分配器、触发器以及移除器的接口。

source: In the following sections, we discuss these three cases.
zh_cn: 接下来的几节我们就来详细讨论一下这三种情况。

source: In the following sections, you will learn how to implement idempotent or transactional sink connectors.
zh_cn: 下面几节将向你介绍如何实现幂等性或事务性的数据汇连接器。

source: In the following we describe how to set these parameters.
zh_cn: 下面我们来介绍如何设置它们。

source: In the following we focus on changing the data type of a state.
zh_cn: 所以说，接下来我们将重点关注更改状态的数据类型。

source: In the following we present three classes of applications that are commonly implemented using stateful stream processing, 1) event-driven applications, 2) data pipeline applications, and 3) data analytics applications and give examples of real-world applications.
zh_cn: 接下来我们结合例子，介绍三类常见的状态化流处理应用：1）事件驱动型应用；2）数据管道应用；3）数据分析应用。

source: In the following we will describe how Flink internally implements and handles timestamps and water‐ marks to support streaming applications with event-time semantics.
zh_cn: 接下面我们会介绍Flink内部如何实现和处理时间戳及水位线以支持事件时间语义的流式应用。

source: In the following, the KeySelector function returns the maximum of the tuple fields as the key:
zh_cn: 下面的示例中，KeySelector函数会返回元组中最大的字段作为键值：

source: In the following, we briefly describe the contents and style of each chapter, so you can directly jump to the part that interests you most.
zh_cn: 接下来我们简要介绍一下每个章节的内容和特点，以便于你直接跳到最感兴趣的部分。

source: In the following, we briefly describe the contents of each chapter, so you can directly jump to those chapters that interest you most.
zh_cn: 接下来我们会简要介绍一下每个章节的内容，便于你直接跳到最感兴趣的部分。

source: In the following, we define a case class Person with two fields: name and age.
zh_cn: 下方我们定义了一个样例类Person，它有两个字段：name和age。

source: In the following, we describe both interfaces and their consistency guarantees.
zh_cn: 接下来，我们将介绍上述两个接口以及它们的一致性保障。

source: In the following, we describe how Flink internally implements and handles timestamps and watermarks to support streaming applications with event-time semantics.
zh_cn: 接下面我们会介绍Flink内部如何实现和处理时间戳及水位线以支持事件时间语义的流式应用。

source: In the following, we describe how to obtain the code examples we use here, how to import them into IntelliJ, how to run an example application, and how to debug it.
zh_cn: 下文我们会介绍如何获取书中的示例代码，如何将它们导入IntelliJ以及如何运行和调试它们。

source: In the following, we describe in detail how a task emits watermarks to multiple output tasks and how it advances its event-time clock from the watermarks it receives from its input tasks.
zh_cn: 下面我们将详细介绍一个任务如何将水位线发送至多个输出任务，以及它从多个输入任务获取水位线后如何推动事件时间时钟前进。

source: In the following, we discuss different methods to reference fields and define keys on data types.
zh_cn: 接下来我们将讨论基于数据类型定义引用字段和键值的几种方法。

source: In the following, we discuss the DataStream API transformations that process multiple input streams or emit multiple output streams.
zh_cn: 接下来我们将讨论那些能同时处理多条输入流或产生多条结果流的DataStream API转换。

source: In the following, we discuss the architecture of Flink’s queryable state service and explain how streaming applications can expose queryable state and external applica‐ tions can query it.
zh_cn: 接下来我们将讨论Flink可查询式状态服务的架构，并解释流式应用如何对外提供可查询式状态以及外部应用怎么才能查询到它。

source: In the following, we discuss these options in detail and show how they are applied for process functions and window operators.
zh_cn: 下面我们将详细讨论这些选项，看一看它们如何用于处理函数和窗口算子中。

source: In the following, we explain how applications can be evolved while preserving savepoint compatibility.
zh_cn: 接下来我们将介绍如何在保持检查点兼容的前提下更新应用。

source: In the following, we explain how this algorithm works.
zh_cn: 接下来我们解释一下这个算法的工作原理。

source: In the following, we explain this step in detail for IntelliJ.
zh_cn: 下文我们会以IntelliJ为例对该步骤进行详细解释。

source: In the following, we list and briefly describe the most important REST calls.
zh_cn: 接下来我们将列举几个最为重要的REST调用，并它们做一个简要介绍。
